---
layout: post
title: Go의 http client는 무겁다
date: 2015-09-18 07:48:00
---
ab로 스트레스 테스트를 해본적이 있다면 느꼈겠지만 사실 서버의 스트레스 테스트보다는 ab를 돌리는 컴퓨터에서의 스트레스 테스트를 하는 꼴이 된다.

전에 어떤 글을 하나 봤었는데 nodejs(였는지 확실히 기억안남 ㅜㅜ scala같기도 하고)랑 Go로 각각 서버, 클라이언트를 짜고 nodejs로 서버, 클라이언트를 짜서 테스트를 하는 벤치마킹 글이였다. 글 내용은 nodejs의 압승. 하지만 댓글에서 반전이 발생한다. 같은 클라이언트를 썼을땐 Go 버전이 1.0 임에도 불구하고 Go가 더 빠르다는 것. Go는 1.5에 들어와서 GC의 성능이 미친듯이 좋아졌다

그게 갑자기 생각나서 Go로 3천개의 http client를 사용하는 프로그램을 짰다. AMD X2 250을 사용하는 윈도우와 vultr vps 1cpu debian, 카페24 가성서버 램 1기가 ubuntu 에서 각각 테스트 하였다. 3천개가 돌아가기 시작하면 goroutine은 6만개 이상으로 늘어나고 이 수는 줄지를 않는다

윈도우는 cpu 30% 미만을 유지하고 400MB정도의 메모리를 사용하였고, vultr에서는 cpu 100%, 램을 4기가까지 늘렸음에도 스왑까지 계속 사용하는 상태가 되었다. 카페24는 8코어 cpu 쉐어라 그런지 cpu사용률 800%를 기록하는 간지를 보여줬고 램 역시 스왑이 넘쳐났다. 카페24 vps 개꾸짐. vultr 1코어보다 느림 ㄷㄷ

무튼 윈도우는 접고 debian, ubuntu에서 더 테스트를 해봤는데 램 사용량은 끝이 안보이게 늘어났고 웃긴점은 어딘가에서 가끔 goroutine이 블락이 걸린다. pprof로 프로파일링을 해봤는데 한번 블락이 걸린 고루틴은 종료할때까지 절대로 반환이 되지 않았다. 게다가 goroutine이 바쁜 상태가 되니 3천개의 client를 유지하지 못하고 낮을땐 400개 많을땐 최대치인 3천개 까지 client가 살아있는 갯수가 마구마구 바뀌고  timeout 시간이 지켜지질 않는다. 난 분명 5초로 했는데 타임아웃이 1분도 넘게 걸려... 뭐야 이거 무서워...

모두 각각 다른 client, transport를 사용하고 timeout은 5초 였는데 계속 어디선가 블락이 된다. net/http/client.go 를 대충 살펴보니 아마 리다이렉트 부분에서 타임아웃이 발생했을때 어딘가에서 블락이 걸린듯 싶다. transport 까지 각각 다르게 사용 했는데 왜 걸린지 모르겠음. 찾기 귀찮아... 헤헤

그래서 직접 소켓을 사용하고 100 continue만 체크해서 3천개의 고루틴을 돌렸는데 vultr에서는 cpu 40% 미만, 카페24 가상서버는 500~600% 정도의 cpu 사용률을 보여줬고, 램 사용량은 둘 다 40MB 정도로 줄어들었다. 며칠동안 테스트를 해봤는데 당연히 알 수 없는 어딘가에서 블락 되는 일은 없었고 client는 vultr에서는 항상 3천개가 돌아가고 카페24에서는 역시 지멋대로 1000~3000개 까지 바뀐다. 카페24 가상서버 성능이 많이 안좋다.

혹시 Go로 대량의 http client를 사용해야 한다면 웬만하면 직접 짜서 쓰는게 좋다
